[
  {
    "id": 0,
    "title": "The Infinity Gaunlet",
    "starRating": "8.4",
    "house": "Marvel",
    "year": "1991",
    "genre": "Apocalypse",
    "price": 25,
    "salePer": 25,
    "newprice": 0,
    "status": true,
    "tag": "SALE",
    "sale": true,
    "image": "https://readcomicsonline.ru/uploads/manga/infinity-gauntlet-19911992/chapters/1/01.jpg",
    "urlImages": "https://readcomicsonline.ru/uploads/manga/infinity-gauntlet-19911992/chapters/",
    "description": "Seeking to impress the Mistress Death, who returned him to life, Thanos has gained control over the Infinity Gauntlet -- making him an all-powerful god! With Mephisto as his familiar, Thanos wipes out half of the life in the universe with a snap of his fingers! What will Earth do when half its the heroes are killed?",
    "chapters": 6,
    "pages": [40, 41, 40, 41, 41, 39],
    "amount": 0
  },
  {
    "id": 1,
    "title": "Old Man Logan",
    "starRating": "2.34",
    "house": "Marvel",
    "year": "2008",
    "genre": "Apocalypse",
    "price": 53,
    "salePer": 75,
    "newprice": 0,
    "status": true,
    "tag": "SALE",
    "sale": true,
    "image": "https://readcomicsonline.ru/uploads/manga/old-man-logan-2015/chapters/1/01.jpg",
    "urlImages": "https://readcomicsonline.ru/uploads/manga/old-man-logan-2015/chapters/",
    "description": "Fifty years from now, Logan- the man who no longer calls himself Wolverine- will have endured many atrocities: The Marvel Universe's villains will have banded together and rid the world of its heroes. Logan's closest friend, Hawkeye, will have been murdered in cold blood right before his eyes. And driven mad by the same radiation that gave him his superhuman strength, Bruce Banner will have fathered a family of hillbilly Hulks...that eventually went on to slaughter Logan's wife and two children. But now, in the present, Old Man Logan wakes up to discover himself in a world before these atrocities, before the Wasteland. And he's going to seize this opportunity and change history to ensure that his future never comes to pass.",
    "chapters": 50,
    "pages": [24, 21, 21, 19, 24, 21, 22, 24, 21, 20, 19, 21, 19, 21, 20, 21, 20, 20, 19, 21, 21, 22, 20, 22, 24, 22, 23, 23, 21, 22, 24, 22, 23, 23, 24, 22, 23, 23, 23, 23, 24, 23, 21, 22, 24, 24, 24, 24, 24, 34],
    "amount": 0
  },
  {
    "id": 2,
    "title": "Secret Empire ",
    "starRating": "2.34",
    "house": "Marvel",
    "year": "2015",
    "genre": "Nazi",
    "price": 144,
    "salePer": 45,
    "newprice": 0,
    "status": true,
    "tag": "SALE",
    "sale": true,
    "image": "https://readcomicsonline.ru/uploads/manga/secret-empire-2017/chapters/0/01.jpg",
    "urlImages": "https://readcomicsonline.ru/uploads/manga/secret-empire-2017/chapters/",
    "description": "The Marvel Universe is under siege from within! Captain America, secretly a true believer in the cause of Hydra, has turned his back on the Super Hero community. Using the trust and respect he has gained over the years he has ascended to a position where he can enacts Hydra's ideals. The death of Jack Flag, the trial of Maria Hill, the second Civil War, the alien Chitauri Queen. All of the dominos of Captain America's plan have been laid out – and it will take only the slightest push to set them into action! Now, the Avengers, the Champions, the Defenders, the Guardians of the Galaxy, the X-Men and more will be tested. As Hydra's grip tightens around the Marvel Universe, the heroes stand at the precipice of an unprecedented challenge. How will they Marvel Universe cope with this shattering betrayal by the most trusted among them?",
    "chapters": 11,
    "pages": [41, 44, 33, 30, 40, 36, 41, 37, 40, 39, 41],
    "amount": 0
  },
  {
    "id": 3,
    "title": "Vision",
    "starRating": "2.34",
    "house": "Marvel",
    "year": "2015",
    "genre": "Family",
    "price": 113,
    "salePer": 50,
    "newprice": 0,
    "status": true,
    "tag": "SALE",
    "sale": true,
    "image": "https://readcomicsonline.ru/uploads/manga/vision-directors-cut-2017/chapters/1/01.jpg",
    "urlImages": "https://readcomicsonline.ru/uploads/manga/vision-directors-cut-2017/chapters/",
    "description": "One of the most surprising super-hero stories ever told, now better than ever! Experience Tom King and Gabriel Hernandez Walta's masterpiece…re-presented with bonus behind-the-scenes content! Behold the Visions! They're the family next door, and they have the power to kill us all. What could possibly go wrong? Collecting VISION (2015) #1-2, plus extras — including Tom King's original series pitch, script excerpts, character designs and sketches by Gabriel Hernandez Walta, cover sketches by Mike del Mundo and more.",
    "chapters": 6,
    "pages": [80, 82, 81, 82, 81, 81],
    "amount": 0
  },
  {
    "id": 4,
    "title": "Civil War II",
    "starRating": "2.34",
    "house": "Marvel",
    "year": "2016",
    "genre": "CrossOver",
    "price": 100,
    "salePer": 0,
    "status": true,
    "tag": "NEW",
    "sale": false,
    "image": "https://readcomicsonline.ru/uploads/manga/civil-war-ii-2016/chapters/1/01.jpg",
    "urlImages": "https://readcomicsonline.ru/uploads/manga/civil-war-ii-2016/chapters/",
    "description": "It's here! The explosive first chapter in the comic event EVERYONE will be talking about. And we come out swinging with a blistering double-sized first issue from the creative team behind last year's best-selling debut of INVINCIBLE IRON MAN and Miles Morales. A new Inhuman, with the ability to profile the future, emerges and the ramifications ripple into every corner of the Marvel Universe. Lines are drawn, bodies fall, and the Marvel Universe will be rocked to it's very core. The action starts here!",
    "chapters": 8,
    "pages": [41, 27, 33, 32, 31, 29, 29, 38],
    "amount": 0
  },
  {
    "id": 5,
    "title": "Dark Knight of Steel",
    "starRating": "2.34",
    "house": "DC",
    "year": "2021",
    "genre": "Medieval",
    "price": 53,
    "salePer": 0,
    "status": true,
    "tag": "NEW",
    "sale": false,
    "image": "https://readcomicsonline.ru/uploads/manga/dark-knights-of-steel-2021/chapters/1/01.jpg",
    "urlImages": "https://readcomicsonline.ru/uploads/manga/dark-knights-of-steel-2021/chapters/",
    "description": "An entire medieval world will be forever changed when a spaceship crash-lands from a doomed planet. Monarchs will die, kingdoms will rise, and what seemed the end of the world for many…was only the beginning! An epic high-fantasy story set in a DC Universe where nothing is what it seems… From worldwide bestselling writer Tom Taylor (DCeased, Superman: Son of Kal-El) and acclaimed artist Yasmine Putri comes a generational tale of good and evil within a brand-new DCU!",
    "chapters": 7,
    "pages": [31, 27, 27, 26, 27, 27, 33],
    "amount": 0
  },
  {
    "id": 6,
    "title": "Devil’s reign ",
    "starRating": "2.34",
    "house": "Marvel",
    "year": "2021",
    "genre": "Politics",
    "price": 144,
    "salePer": 0,
    "status": true,
    "tag": "NEW",
    "sale": false,
    "image": "https://readcomicsonline.ru/uploads/manga/devils-reign-2021/chapters/1/01.jpg",
    "urlImages": "https://readcomicsonline.ru/uploads/manga/devils-reign-2021/chapters/",
    "description": "The story that’s been building for years is here! Wilson Fisk went from Kingpin to mayor of the biggest city in America and is going to bring his full criminal and political power to bear on the super heroes who call NYC home. The man who once destroyed Daredevil has set his sights on The Fantastic Four, Iron Man, Captain America, Spider-Man, Jessica Jones, Luke Cage and more. And since it’s Fisk, once he takes them all down, you know he’s going to sign it. CROSSBONES! TASKMASTER! TYPHOID MARY! SHOCKER! WHIPLASH! RHINO! KRAVEN! Fisk has an ARMY of super villains at his command – and this is just his opening salvo. For years, Fisk has waited for his time to strike, and YOU WON’T BELIEVE the aces he’s got up his sleeves!",
    "chapters": 6,
    "pages": [35, 25, 26, 26, 25, 35],
    "amount": 0
  },
  {
    "id": 7,
    "title": "Batman: The killing joke",
    "starRating": "5.00",
    "house": "DC",
    "year": "1988",
    "genre": "Gore",
    "price": 113,
    "salePer": 0,
    "status": false,
    "tag": "null",
    "sale": false,
    "image": "https://readcomicsonline.ru/uploads/manga/batman-the-killing-joke/chapters/the-killing-joke/01.jpg",
    "urlImages": "https://readcomicsonline.ru/uploads/manga/batman-the-killing-joke/chapters/",
    "description": "As Batman hunts for the escaped Joker, the Clown Prince of Crime attacks the Gordon family to prove a diabolical point mirroring his own fall into madness. (Reprinted edition with muted colors)",
    "chapters": 1,
    "pages": [47],
    "amount": 0
  },
  {
    "id": 8,
    "title": "Flashpoint Beyond",
    "starRating": "4.34",
    "house": "DC",
    "year": "2022",
    "genre": "Timetravel",
    "price": 100,
    "salePer": 0,
    "status": true,
    "tag": "HOT",
    "sale": false,
    "image": "https://readcomicsonline.ru/uploads/manga/flashpoint-beyond-2022/chapters/1/01.jpg",
    "urlImages": "https://readcomicsonline.ru/uploads/manga/flashpoint-beyond-2022/chapters/",
    "description": "After sacrificing everything to help The Flash put the universe back together and save Bruce Wayne’s life, Thomas Wayne wakes up in a world he thought was no more. Forced to don the cowl once again, Batman prowls the streets of Gotham City searching for answers to how this world still exists, but what he starts to uncover will send him hurtling around the globe. The hunt for the Clockwork Killer starts here!",
    "chapters": 3,
    "pages": [30, 32, 27],
    "amount": 0
  },
  {
    "id": 9,
    "title": "Eternals",
    "starRating": "5.00",
    "house": "Marvel",
    "year": "2021",
    "genre": "Mythology",
    "price": 75,
    "salePer": 0,
    "status": true,
    "tag": "HOT",
    "sale": false,
    "image": "https://readcomicsonline.ru/uploads/manga/eternals-2021/chapters/1/01.jpg",
    "urlImages": "https://readcomicsonline.ru/uploads/manga/eternals-2021/chapters/",
    "description": "NEVER DIE. NEVER WIN. ETERNALS. What's the point of an eternal battle? For millions of years, one hundred Eternals have roamed the Earth, secret protectors of humanity. Without them, we'd be smears between the teeth of the demon-like Deviants. Their war has waged for all time, echoing in our myths and nightmares. But today, Eternals face something new: change. Can they – or anyone on Earth – survive their discovery? From the thought provoking minds of Kieron Gillen (The Wicked + The Divine, Uncanny X-Men, Thor) and Esad Ribić (Secret Wars, King Thor) comes a new vision of the classic Marvel mythology!",
    "chapters": 12,
    "pages": [32, 26, 27, 25, 27, 26, 25, 26, 25, 26, 26, 26],
    "amount": 0
  },
  {
    "id": 10,
    "title": "The Mighty Valkyries",
    "starRating": "3.54",
    "house": "Marvel",
    "year": "2021",
    "genre": "Mythology",
    "price": 60,
    "salePer": 0,
    "status": false,
    "tag": "null",
    "sale": false,
    "image": "https://readcomicsonline.ru/uploads/manga/the-mighty-valkyries-2021/chapters/1/01.jpg",
    "urlImages": "https://readcomicsonline.ru/uploads/manga/the-mighty-valkyries-2021/chapters/",
    "description": "JANE FOSTER GETS A FRESH START – AND ALLIES BOTH NEW AND OLD! Jane Foster believed she was the only Valkyrie left – but the fight against Knull, the King in Black, proved her wrong. Now the Valkyries must redefine their roles in a changing world – and Asgard’s not going to make it easy. When Loki comes to Jane with rumors of a beast stalking the souls of Midgard, she leaps into action – but she’s not the only one after the strange wolf’s hide. She’ll need backup...but her ancient coworker has other priorities. Years ago, the warrior made a promise to a woman she loved. And now, it’s time to follow through. Get the real story behind the Marvel Universe’s newest star – and don’t miss the start of an all-new epic adventure from powerhouses Jason Aaron, Torunn Grønbekk and Mattia de Iulis!",
    "chapters": 5,
    "pages": [34, 24, 24, 24, 24],
    "amount": 0
  },
  {
    "id": 11,
    "title": "Batman: One Dark Knight",
    "starRating": "4.43",
    "house": "DC",
    "year": "2021",
    "genre": "Thriller",
    "price": 35,
    "salePer": 0,
    "status": false,
    "tag": "null",
    "sale": false,
    "image": "https://readcomicsonline.ru/uploads/manga/batman-one-dark-knight-2021/chapters/1/01.jpg",
    "urlImages": "https://readcomicsonline.ru/uploads/manga/batman-one-dark-knight-2021/chapters/",
    "description": "From high above the sweltering summer streets of Gotham, Batman planned to escort the GCPD as the dangerous metahuman super-villain known as E.M.P. was transferred from a holding cell to his permanent home at Blackgate Prison. E.M.P.’s electrical powers posed a threat, but the situation was in hand-until it wasn’t. Now every light in Gotham is out, the police are in disarray, and a broken, bleeding Batman must fight his way to Blackgate, block by block, dragging E.M.P. behind him. But the dark corners of Gotham hold many surprises…and E.M.P. has many more shocks to deliver before the night is through! One of the most iconic Batman artists of the 21st century, the incomparable Jock (The Batman Who Laughs, Batman: The Black Mirror), has focused all his storytelling powers on the tale of one very, very dark night in Gotham City. It’s always darkest before the dawn-if it ever comes.",
    "chapters": 2,
    "pages": [50, 51],
    "amount": 0
  },
  {
    "id": 12,
    "title": "Wonder Woman & the Justice League America",
    "starRating": "5.00",
    "house": "DC",
    "year": "2021",
    "genre": "Political",
    "price": 75,
    "salePer": 0,
    "status": false,
    "tag": "null",
    "sale": false,
    "image": "https://readcomicsonline.ru/uploads/manga/wonder-woman-the-justice-league-america-2017/chapters/vol-1/01.jpg",
    "urlImages": "https://readcomicsonline.ru/uploads/manga/wonder-woman-the-justice-league-america-2017/chapters/",
    "description": "Wonder Woman takes over as leader of the Justice League of America, whether other members like it or not! Acting at the behest of the United Nations, the team must respond to a human rights crisis in a remote African nation, only to find the populace under the thumbs of the super-powered Extremists. The team must then jet to Norway, where the young superhero called Ice struggles to keep the nation out of the hands of her older brother.",
    "chapters": 1,
    "pages": [221],
    "amount": 0
  },
  {
    "id": 13,
    "title": "Green Lantern",
    "starRating": "2.77",
    "house": "DC",
    "year": "2021",
    "genre": "Space",
    "price": 45,
    "salePer": 0,
    "status": false,
    "tag": "null",
    "sale": false,
    "image": "https://readcomicsonline.ru/uploads/manga/green-lantern-2021/chapters/1/01.jpg",
    "urlImages": "https://readcomicsonline.ru/uploads/manga/green-lantern-2021/chapters/",
    "description": "As this new Green Lantern series begins, the newly formed United Planets and the Guardians of the Universe hold an intergalactic summit to decide who can best serve and protect the cosmos from danger. With the majority of Green Lanterns called back to Oa, John Stewart arrives alongside Teen Lantern Keli Quintela, whose powerful gauntlet could be one of the most powerful and unstable weapons in the universe. With the entire landscape of the universe in flux, is this the end of the Green Lantern Corps...or a new beginning.",
    "chapters": 12,
    "pages": [34, 32, 40, 35, 37, 35, 34, 41, 35, 35, 35, 34],
    "amount": 0
  },
  {
    "id": 14,
    "title": "War Of The Realms Omega",
    "starRating": "5.00",
    "house": "Marvel",
    "year": "2019",
    "genre": "Space",
    "price": 30,
    "salePer": 0,
    "status": true,
    "tag": "HOT",
    "sale": false,
    "image": "https://readcomicsonline.ru/uploads/manga/war-of-the-realms-omega-2019/chapters/1/01.jpg",
    "urlImages": "https://readcomicsonline.ru/uploads/manga/war-of-the-realms-omega-2019/chapters/",
    "description": "THE WAR IS OVER – AND THE MARVEL UNIVERSE MUST PICK UP THE PIECES! Midgard is broken, and as heroes of Asgard and Earth alike start to sift through the pieces, new heroes — and villains — emerge. What’s next for Jane Foster, now free of the hammer she was willing to die to hold? Thor’s brother Loki faced a terrible fate in the War of the Realms — and now the god of mischief must make himself anew. For the Punisher, the war isn’t even close to finished — but this time, he’s got his own army. And for Thor himself, destiny has finally arrived. The God of Thunder strikes out for a whole new adventure!",
    "chapters": 1,
    "pages": [36],
    "amount": 0
  },
  {
    "id": 15,
    "title": "Suicide Squad Black Files",
    "starRating": "4.00",
    "house": "DC",
    "year": "2018",
    "genre": "Thriller",
    "price": 45,
    "salePer": 0,
    "status": false,
    "tag": "null",
    "sale": false,
    "image": "https://readcomicsonline.ru/uploads/manga/suicide-squad-black-files-2018/chapters/1/01.jpg",
    "urlImages": "https://readcomicsonline.ru/uploads/manga/suicide-squad-black-files-2018/chapters/",
    "description": "Two members of Task Force X are back in these all-new adventures! First up: “REVENGE OF KOBRA” by writer Mike W. Barr and artist Philippe Briones. To oppose the terrorist Kobra is to earn his un-dying hatred, and that’s what the samurai Katana did when she killed his beloved Eve. Now Kobra stalks Katana beyond the bounds of the Earth itself, to a supernatural world where he will steal from her everything that she has-including her very soul! And in “SUICIDE SQUAD BLACK,” by writer Jai Nitz and artist Scot Eaton, Sebastian Faust, the U.S. government’s top arcane operative, has gone rogue! To track down America’s most dangerous magician, Amanda Waller assembles a special-ops team unlike any other: an expendable coven of dark-arts experts including El Diablo, Enchantress and Gentleman Ghost. They are Suicide Squad Black, and they will take you to places where even the dead can die!",
    "chapters": 6,
    "pages": [43, 42, 46, 43, 43, 43],
    "amount": 0
  },
  {
    "id": 16,
    "title": "Doctor Strange - The Punisher - Magic Bullets Infinite",
    "starRating": "4.42",
    "house": "Marvel",
    "year": "2016",
    "genre": "Action",
    "price": 100,
    "salePer": 20,
    "status": true,
    "tag": "SALE",
    "sale": true,
    "image": "https://readcomicsonline.ru/uploads/manga/doctor-strange-the-punisher-magic-bullets-infinite/chapters/1/01.jpg",
    "urlImages": "https://readcomicsonline.ru/uploads/manga/doctor-strange-the-punisher-magic-bullets-infinite/chapters/",
    "description": "The team-up to end all team-ups is here, as two of the most different Marvel characters worlds' collide! What new mafia threat is so great that the Punisher needs Doctor Strange's help? Find out as the Sorcerer Supreme teams with the One Man War on Crime!",
    "chapters": 8,
    "pages": [75, 80, 94, 75, 79, 79, 81, 81],
    "amount": 0
  },
  {
    "id": 17,
    "title": "Doctor Strange: The Way of the Weird Infinity Comic",
    "starRating": "5.00",
    "house": "Marvel",
    "year": "2022",
    "genre": "Mystic",
    "price": 30,
    "salePer": 0,
    "status": true,
    "tag": "NEW",
    "sale": false,
    "image": "https://readcomicsonline.ru/uploads/manga/doctor-strange-the-way-of-the-weird-infinity-comic-2022/chapters/1/01.jpg",
    "urlImages": "https://readcomicsonline.ru/uploads/manga/doctor-strange-the-way-of-the-weird-infinity-comic-2022/chapters/",
    "description": "Doctor Strange: The Way of the Weird Infinity Comic",
    "chapters": 4,
    "pages": [81, 53, 60, 75],
    "amount": 0
  }
]
